import '../GenericPage.css';

const AboutUs = () => {
  return (
    <div className="generic-page-container" dir="rtl">
      <h1>من نحن ؟</h1>
      <p>
        مرحباً بكم في Click Shop Maroc.
        نحن متجر إلكتروني متخصص في بيع [الاكسسوارات المنزلية العصرية].
      </p>
      <p>
        هدفنا هو توفير أفضل المنتجات لزبنائنا بأثمنة مناسبة، مع التركيز على الجودة وخدمة ما بعد البيع.
      </p>

      <h2>لماذا تختارنا ؟</h2>
      <ul>
        <li>منتجات مختارة بعناية لضمان الجودة.</li>
        <li>خدمة توصيل سريعة لجميع مدن المغرب.</li>
        <li>ضمان على المنتجات وإمكانية الاستبدال والإرجاع.</li>
        <li>فريق دعم فني مستعد للإجابة على جميع أسئلتكم.</li>
      </ul>
    </div>
  );
};

export default AboutUs;